=
ЕСЛИ(И(D32=P31;ИЛИ(0<M31<C33;M31=C33));D33;
ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C33;M31=C33));E33;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C33;M31=C33));F33;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C33;M31=C33));G33;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C33;M31=C33));F33;
ЕСЛИ(И(I32=P31;ИЛИ(0<M31<C33;M31=C33));I33;

ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C34;M31=C34));E34;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C34;M31=C34));F34;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C34;M31=C34));G34;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C34;M31=C34));F34;
ЕСЛИ(И(I32=P31;ИЛИ(0<M31<C34;M31=C34));I34;

ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C35;M31=C35));E35;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C35;M31=C35));F35;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C35;M31=C35));G35;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C35;M31=C35));F35;
ЕСЛИ(И(I32=P31;ИЛИ(0<M31<C35;M31=C35));I35;

ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C36;M31=C33));E36;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C36;M31=C33));F36;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C36;M31=C33));G36;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C36;M31=C33));F36;
ЕСЛИ(И(I32=P31;ИЛИ(0<M31<C36;M31=C33));I36;

ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C37;M31=C37));E37;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C37;M31=C37));F37;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C37;M31=C37));G37;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C37;M31=C37));F37;


ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C38;M31=C38));E38;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C38;M31=C38));F38;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C38;M31=C38));G38;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C38;M31=C38));F38;


ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C39;M31=C39));E39;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C39;M31=C39));F39;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C39;M31=C39));G39;


ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C40;M31=C40));E40;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C40;M31=C40));F40;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C40;M31=C40));G40;


ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C41;M31=C41));E41;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C41;M31=C41));F41;


ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C42;M31=C42));E42;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C42;M31=C42));F42;


ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C43;M31=C43));E43;


ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C44;M31=C44));E44;

)))))))))))))))))))))))))))))))))))))))))
ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C45;M31=C45));E45;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C45;M31=C45));F45;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C45;M31=C45));G45;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C45;M31=C45));F45;
ЕСЛИ(И(I32=P31;ИЛИ(0<M31<C45;M31=C45));I45;

ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C46;M31=C46));E46;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C46;M31=C46));F46;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C46;M31=C46));G46;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C46;M31=C46));F46;
ЕСЛИ(И(I32=P31;ИЛИ(0<M31<C46;M31=C46));I46;

ЕСЛИ(И(E32=P31;ИЛИ(0<M31<C47;M31=C47));E47;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C47;M31=C47));F47;
ЕСЛИ(И(G32=P31;ИЛИ(0<M31<C47;M31=C47));G47;
ЕСЛИ(И(F32=P31;ИЛИ(0<M31<C47;M31=C47));F47;
ЕСЛИ(И(I32=P31;ИЛИ(0<M31<C47;M31=C47));I47;
))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))))
=
ЕСЛИ(И(AI31=D31;ИЛИ(C32=AF31;0<AF31<C32));D32;
ЕСЛИ(И(AI31=D31;ИЛИ(C33=AF31;И(C32<AF31;AF31<C33)));D33;
ЕСЛИ(И(AI31=D31;ИЛИ(C34=AF31;И(C33<AF31;AF31<C34)));D34;
ЕСЛИ(И(AI31=D31;ИЛИ(C35=AF31;И(C34<AF31;AF31<C35)));D35;
ЕСЛИ(И(AI31=D31;ИЛИ(C36=AF31;И(C35<AF31;AF31<C36)));D36;
ЕСЛИ(И(AI31=D31;ИЛИ(C37=AF31;И(C36<AF31;AF31<C37)));D37;
ЕСЛИ(И(AI31=D31;ИЛИ(C38=AF31;И(C37<AF31;AF31<C38)));D38;
ЕСЛИ(И(AI31=D31;ИЛИ(C39=AF31;И(C38<AF31;AF31<C39)));D39;
ЕСЛИ(И(AI31=D31;ИЛИ(C40=AF31;И(C39<AF31;AF31<C40)));D40;
ЕСЛИ(И(AI31=D31;ИЛИ(C41=AF31;И(C40<AF31;AF31<C41)));D41;
ЕСЛИ(И(AI31=D31;ИЛИ(C42=AF31;И(C41<AF31;AF31<C42)));D42;
ЕСЛИ(И(AI31=D31;ИЛИ(C43=AF31;И(C42<AF31;AF31<C43)));D43;
ЕСЛИ(И(AI31=D31;ИЛИ(C44=AF31;И(C43<AF31;AF31<C44)));D44;
ЕСЛИ(И(AI31=D31;ИЛИ(C45=AF31;И(C44<AF31;AF31<C45)));D45;
ЕСЛИ(И(AI31=D31;ИЛИ(C46=AF31;И(C45<AF31;AF31<C46)));D46;
ЕСЛИ(И(AI31=D31;ИЛИ(C47=AF31;И(C46<AF31;AF31<C47)));D47;
ЕСЛИ(И(AI31=D31;ИЛИ(C48=AF31;И(C47<AF31;AF31<C48)));D48;
ЕСЛИ(И(AI31=D31;ИЛИ(C49=AF31;И(C48<AF31;AF31<C49)));D49;
ЕСЛИ(И(AI31=D31;ИЛИ(C50=AF31;И(C49<AF31;AF31<C50)));D50;
ЕСЛИ(И(AI31=D31;ИЛИ(C51=AF31;И(C50<AF31;AF31<C51)));D51;
ЕСЛИ(И(AI31=D31;ИЛИ(C52=AF31;И(C51<AF31;AF31<C52)));D52;
ЕСЛИ(И(AI31=D31;ИЛИ(C53=AF31;И(C52<AF31;AF31<C53)));D53;
ЕСЛИ(И(AI31=D31;ИЛИ(C54=AF31;И(C53<AF31;AF31<C54)));D54;	
)))))))))))))))))))))))

//
=
ЕСЛИ(AH37=L27;L28;
ЕСЛИ(AH37=M27;M28;
ЕСЛИ(AH37=N27;N28;
ЕСЛИ(AH37=O27;O28;
ЕСЛИ(AH37=P27;P28;
ЕСЛИ(AH37=Q27;Q28;
ЕСЛИ(AH37=R27;R28;
ЕСЛИ(AH37=S27;S28;
ЕСЛИ(AH37=T27;T28;
ЕСЛИ(AH37=U27;U28;
ЕСЛИ(AH37=V27;V28;
ЕСЛИ(AH37=W27;W28;
ЕСЛИ(AH37=X27;X28;
ЕСЛИ(AH37=Y27;Y28;
ЕСЛИ(AH37=Z27;Z28;
ЕСЛИ(AH37=AA27;AA28;"отсутствует значение"
))))))))))))))))

//
=
ЕСЛИ(C32=1,1;H27;
ЕСЛИ(C32=1,5;I27;
ЕСЛИ(C32=2,2;I27;
ЕСЛИ(C32=3;K27;
ЕСЛИ(C32=4;L27;
ЕСЛИ(C32=5,5;L27;
ЕСЛИ(C32=7,5;M27;
ЕСЛИ(C32=11;2N7;
ЕСЛИ(C32=15;O27;
ЕСЛИ(C32=18,5;O27;
ЕСЛИ(C32=22;O27;
ЕСЛИ(C32=30;O27;
ЕСЛИ(C32=37;O27;
ЕСЛИ(C32=45;O27;
ЕСЛИ(C32=55;O27;
ЕСЛИ(C32=75;O27;
ЕСЛИ(C32=90;O27;
ЕСЛИ(C32=110;O27;
ЕСЛИ(C32=132;O27;
ЕСЛИ(C32=160;O27;
ЕСЛИ(C32=200;O27;
ЕСЛИ(C32=250;O27;
ЕСЛИ(C32=315;O27;
ЕСЛИ(C32=400;O27;"Неккоректное значение"

))))))))))))))))))))))))